```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/doge-test/runs/run-nvYGKJrxCStkXAgH

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
module.base.digitalocean_project.do_project: Refreshing state... [id=122b7cb3-8c3a-4cb6-b89b-af83fb4714ae]
module.base.tls_private_key.ssh_key: Refreshing state... [id=b4f26398756d9a9f58ead9df4b0d9e07cf3abb20]
module.base.data.template_file.cloud-init-yaml: Reading...
module.base.digitalocean_ssh_key.ssh_key: Refreshing state... [id=35839307]
module.base.data.template_file.cloud-init-yaml: Read complete after 0s [id=f2d815db1bb2bb72ffd21da7f3aca74b865d75158580054ca5d77285ac6a8c8e]
module.base.github_repository.repo: Refreshing state... [id=doge-test]
module.base.github_branch.staging: Refreshing state... [id=doge-test:staging]
module.base.github_branch_protection.staging: Refreshing state... [id=BPR_kwDOHwWLSM4BptXl]
module.base.github_branch_protection.develop: Refreshing state... [id=BPR_kwDOHwWLSM4BptXm]
module.base.github_branch.develop: Refreshing state... [id=doge-test:develop]
module.infrastructure.github_repository_environment.env: Refreshing state... [id=doge-test:staging]
module.base.github_actions_secret.ssh_key: Refreshing state... [id=doge-test:ssh_key]
module.infrastructure.digitalocean_droplet.droplet: Refreshing state... [id=310889767]
module.infrastructure.data.sshclient_host.host: Reading...
module.infrastructure.data.sshclient_host.host: Read complete after 0s [id=5a9806f6-c178-427f-88c2-6ba6e76727d2]
module.infrastructure.data.sshclient_keyscan.keyscan: Reading...
module.infrastructure.digitalocean_project_resources.droplets: Refreshing state... [id=122b7cb3-8c3a-4cb6-b89b-af83fb4714ae]
module.infrastructure.data.sshclient_keyscan.keyscan: Read complete after 0s [id=de21a1b7-e64e-48c6-ae7a-f0c0b3ea1256]
module.infrastructure.github_actions_environment_secret.known_hosts: Refreshing state... [id=doge-test:staging:known_hosts]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.github_actions_environment_secret.droplet_host will be created
  + resource "github_actions_environment_secret" "droplet_host" {
      + created_at      = (known after apply)
      + environment     = "staging"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "doge-test"
      + secret_name     = "droplet_host"
      + updated_at      = (known after apply)
    }

  # module.infrastructure.github_actions_environment_secret.droplet_user will be created
  + resource "github_actions_environment_secret" "droplet_user" {
      + created_at      = (known after apply)
      + environment     = "staging"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "doge-test"
      + secret_name     = "droplet_user"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```